
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))


(A 1 10)                                ; 1024
(A 2 4)                                 ; 65536
(A 3 3)                                 ; 65536


;;; (f n) の値は
;;; n  = 0 のとき、0
;;; n >= 1 のとき、2n
(define (f n) (A 0 n))
(f 0)                                   ; 0
(f 1)                                   ; 2
(f 3)                                   ; 6
(f 20)                                  ; 40


;;; (g n) の値は
;;; n =  0 のとき、0
;;; n >= 1 のとき、2^n
(define (g n) (A 1 n))
(g 0)                                   ; 0
(g 1)                                   ; 2
(g 2)                                   ; 4
(g 3)                                   ; 8
(g 4)                                   ; 16
(g 10)                                  ; 1024


;;; (h n) の値は
;;; n =  0 のとき、0
;;; n =  1 のとき、2
;;; n >= 2 のとき、2^(h (- n 1))
は (h (- n 1))^2 を計算する
(define (h n) (A 2 n))
(h 0)                                   ; 0
(h 1)                                   ; 2
(h 2)                                   ; 4
(h 3)                                   ; 16
(h 4)                                   ; 65536
